package ui

import "github.com/charmbracelet/lipgloss"

func ASCIILogo() string {
	gue := `
 ██████╗ ██╗   ██╗███████╗
██╔════╝ ██║   ██║██╔════╝
██║  ███╗██║   ██║█████╗  
██║   ██║██║   ██║██╔══╝  
╚██████╔╝╚██████╔╝███████╗
 ╚═════╝  ╚═════╝ ╚══════╝
 `

	ssh := `
███████╗███████╗██╗  ██╗
██╔════╝██╔════╝██║  ██║
███████╗███████╗███████║
╚════██║╚════██║██╔══██║
███████║███████║██║  ██║
╚══════╝╚══════╝╚═╝  ╚═╝
`

	return lipgloss.JoinHorizontal(
		lipgloss.Center,
		gue,
		lipgloss.NewStyle().Foreground(Purple).Render(ssh),
	)
}
